# для удобства разместим фрагменты текстов произведений в отдельном файле
text_1 = '''
   -- Что, Петр, не видать еще? -- спрашивал 20-го мая 1859 года, выходя без шапки на низкое крылечко постоялого двора 
   на *** шоссе, барин лет сорока с небольшим, в запыленном пальто и клетчатых панталонах, у своего слуги, молодого и 
   щекастого малого с беловатым пухом на подбородке и маленькими тусклыми глазенками. 
'''
text_2 = '''
      ... безумие и ужас. Впервые я почувствовал это, когда мы шли по энской дороге - шли  десять
      часов непрерывно, не останавливаясь, не замедляя хода, не подбирая упавших и
      оставляя их неприятелю, который сплошными массами двигался сзади нас и через
      три-четыре часа стирал следы наших ног своими ногами. Стоял зной.  Не  знаю,
      сколько было градусов: сорок, пятьдесят или больше; знаю только, что он  был
      непрерывен, безнадежно-ровен и глубок. Солнце было так огромно, так  огненно
      и страшно, как будто земля  приблизилась  к  нему  и  скоро  сгорит  в  этом
      беспощадном  огне.  И  не  смотрели  глаза.  Маленький,  сузившийся  зрачок,
      маленький, как зернышко мака, тщетно искал  тьмы  под  сенью  закрытых  век:
      солнце пронизывало тонкую оболочку и кровавым светом  входило  в  измученный
      мозг. Но все-таки так было лучше, и я долго, быть  может,  несколько  часов,
      шел с закрытыми глазами, слыша, как движется вокруг меня  толпа:  тяжелый  и
      неровный  топот  ног,  людских  и   лошадиных,   скрежет   железных   колес,
      раздавливающих мелкий камень, чье-то тяжелое, надорванное  дыхание  и  сухое
      чмяканье запекшимися губами. Но слов я не слыхал.  Все  молчали,  как  будто
      двигалась армия немых, и, когда кто-нибудь падал, он падал молча,  и  другие
      натыкались на его тело, падали, молча поднимались  и,  не  оглядываясь,  шли
      дальше - как будто эти немые были также глухи и слепы. Я сам  несколько  раз
      натыкался и падал, и тогда невольно открывал глаза, - и  то,  что  я  видел,
      казалось диким  вымыслом,  тяжелым  бредом  обезумевшей  земли.  Раскаленный
      воздух дрожал, и беззвучно, точно готовые потечь, дрожали камни;  и  дальние
      ряды людей на завороте, орудия и лошади  отделились  от  земли  и  беззвучно
      студенисто колыхались - точно не живые люди  это  шли,  а  армия  бесплотных
      теней. Огромное, близкое, страшное солнце на каждом стволе ружья, на  каждой
      металлической бляхе зажгло  тысячи  маленьких  ослепительных  солнц,  и  они
      отовсюду, с боков и снизу забирались в  глаза,  огненно-белые,  острые,  как
      концы добела раскаленных штыков. А иссушающий, палящий жар проникал в  самую
      глубину тела, в кости, в мозг, и чудилось порою, что на плечах  покачивается
      не голова, а какой-то странный и необыкновенный шар, тяжелый и легкий, чужой
      и страшный.
'''
text_3 = '''
           Когда  Елеазар вышел из могилы, где три дня и три ночи находился он под
      загадочною  властию  смерти,  и живым возвратился в свое жилище, в нем долго
      не  замечали  тех зловещих странностей, которые со временем сделали страшным
      самое  имя  его.  Радуясь  светлой радостью о возвращенном к жизни, друзья и
      близкие  ласкали его непрестанно и в заботах о пище и питье и о новой одежде
      утоляли  жадное  внимание  свое.  И  одели его пышно в яркие цвета надежды и
      смеха,  и  когда он, подобно жениху в брачном одеянии, снова сидел среди них
      за  столом,  и  снова  ел,  и  снова  пил,  они  плакали от умиления и звали
      соседей,   чтобы  взглянуть  на  чудесно  воскресшего.  Приходили  соседи  и
      радовались  умиленно; приходили незнакомые люди из дальних городов и селений
      и  в  бурных восклицаниях выражали свое поклонение чуду - точно пчелы гудели
      над домом Марии и Марфы. 
'''
text_4 = '''       -- Пойдем со мной к источникам истины! -- смеясь, сказал мне Дьявол и привел меня на кладбище. 
       И когда мы медленно кружились с ним по узким до-рожкам среди старых камней и чугунных плит над моги-лами, он 
       говорил утомленным голосом старого профес-сора, которому надоела бесплодная проповедь его муд-рости. 
       -- Под ногами твоими,-- говорил он мне,-- лежат творцы законов, которые руководят тобой, ты попи-раешь подошвой 
       сапога прах плотников и кузнецов, ко-торые построили клетку для зверя внутри тебя. 
       Он смеялся при этом острым смехом презрения к лю-дям, обливая траву могил и плесень памятников зелено-ватым 
       блеском холодного взгляда тоскливых глаз. Жир-ная земля мертвых приставала к ногам моим тяжелыми комьями, 
       и было трудно идти по тропинкам, среди па-мятников над могилами житейской мудрости. '''
text_5 = '''
       Волнистая равнина вся исхлёстана серыми дорогами, пёстрый городок Окуров посреди неё -- как затейливая игрушка 
       на широкой, сморщенной ладони. 
       Из густых лесов Чернораменья вытекает ленивая речка Путаница; извиваясь между распаханных холмов, она подошла 
       к городу и разделила его на две равные части: Шихан, где живут лучшие люди, и Заречье -- там ютится 
       низкое мещанство. 
       Разрезав город, река течёт к юго-западу и теряется в ржавом Ляховском болоте; ощетинилось болото тёмным 
       ельником, и уходит мелкий лес густым широким строем в серовато-синюю даль. 
       А на востоке, по вершинам холмов, маячат в бледном небе старые, 
       побитые грозами деревья большой дороги в губернию. '''

# Соберём их в словарь, чтобы обращаться по названиям произведений, а не по названию переменной
text_dict = {'Отцы и дети': text_1,
             'Красный смех': text_2,
             'Елеазар': text_3,
             'Хозяева жизни': text_4,
             'Городок Окуров': text_5}